app/controllers/posts_controller.rb

  def index
    @q = Post.ransack(params[:q])
    @posts = @q.result.page(params[:page]).per(30)
---
SELECT  "posts".* FROM "posts" ORDER BY "posts"."id" ASC LIMIT ? OFFSET ?  [["LIMIT", 30], ["OFFSET", 0]]
SELECT COUNT(*) FROM "posts"

  def show
    @post = Post.find(params[:id])
---
SELECT  "posts".* FROM "posts" WHERE (id < 1) ORDER BY "posts"."id" DESC LIMIT ?  [["LIMIT", 1]]

 def create
    @post = Post.new(post_params)
    if @post.save
---
INSERT INTO "posts" ("company", "tel", "address", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["company", "奥山健太"], ["tel", "0367127837"], ["address", "鶯谷町１９－１９, ３０３"], ["created_at", "2018-07-18 22:48:51.265170"], ["updated_at", "2018-07-18 22:48:51.265170"]]

def call
  @post = Post.find(params[:id])
---
SELECT  "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]